# Concatenating Tables with Set-Like Operations

One of the two way of combining two tables is to stack one table on top of the other.  When stacking two tables on top of one another, we need to decide

1. If we combine columns based on position or name (and if combining by name, what do we do with mismatches?)
2. How to decide which rows to keep.  In this case, we will take some guidance from SQL clauses.

## Three Types of Operations

* **Union:** Keeps rows from either table.
* **Intersection:** Only keeps common columns
* **Set Difference/Except:** Keep rows from the left table *except* those in the right table.

## Set Operations in Action 

<img src="./img/table_verbs_set.gif" width=800>

## All Operations Match by Position

All operations

* Match columns by position
* Require same number/type of columns

## Distinct Versus All

* **UNION/INTERSECT/SET DIFFERENE** are **DISTINCT**
    * Only keeps distinct rows, removing duplicates.
* **UNION ALL/INTERSECT ALL/SET DIFFERENCE ALL**
    * Keeps duplicate rows

In [1]:
import pandas as pd
from dfply import *

In [2]:
sales_may = pd.read_csv('./data/auto_sales_may.csv')
sales_may

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9

In [3]:
sales_apr = pd.read_csv('./data/auto_sales_apr.csv')
sales_apr

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12
1           1         Bob       19     12   17     20
2           2     Yolanda       19      8   32     15
3           3      Xerxes       12     23   18      9

## Unions with `dfply`

Use `left_table >> union(right_table)`

In [4]:
sales_may >> union(sales_apr)

/home/kg3597wc/anaconda3/envs/dsci326/lib/python3.10/site-packages/dfply/set_ops.py:51: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  stacked = df.append(other)

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9
1           1         Bob       19     12   17     20
2           2     Yolanda       19      8   32     15
3           3      Xerxes       12     23   18      9

## `dfply.union` is distinct

Since Ann have the same sales each month, her row only included one row.  Note that we can use `keep='last'` to `keep='first'` to determine which row is kept.

In [6]:
sales_may >> union(sales_apr, keep='last')

/Users/toddiverson/.pyenv/versions/anaconda3-2022.05/lib/python3.9/site-packages/dfply/set_ops.py:51: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  stacked = df.append(other)

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9
0           0         Ann       22     18   15     12
1           1         Bob       19     12   17     20
2           2     Yolanda       19      8   32     15
3           3      Xerxes       12     23   18      9

In [7]:
sales_may >> union(sales_apr, keep='first')

/Users/toddiverson/.pyenv/versions/anaconda3-2022.05/lib/python3.9/site-packages/dfply/set_ops.py:51: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  stacked = df.append(other)

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9
1           1         Bob       19     12   17     20
2           2     Yolanda       19      8   32     15
3           3      Xerxes       12     23   18      9

## Making `union_all`

We can use `pd.concat` to perform a `UNION ALL`

In [5]:
from more_dfply import union_all
sales_may >> union_all(sales_apr)

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9
4           0         Ann       22     18   15     12
5           1         Bob       19     12   17     20
6           2     Yolanda       19      8   32     15
7           3      Xerxes       12     23   18      9

## Adding a month column

Another way to keep both of Ann's sales rows is adding a month column (which we should probably do anyway).

In [9]:
sales_may >> mutate(month = 'May') >> union(sales_apr >> mutate(month = 'April'))

/Users/toddiverson/.pyenv/versions/anaconda3-2022.05/lib/python3.9/site-packages/dfply/set_ops.py:51: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  stacked = df.append(other)

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck  month
0           0         Ann       22     18   15     12    May
1           1         Bob       20     14    6     24    May
2           2     Yolanda       19     10   28     17    May
3           3      Xerxes       11     27   17      9    May
0           0         Ann       22     18   15     12  April
1           1         Bob       19     12   17     20  April
2           2     Yolanda       19      8   32     15  April
3           3      Xerxes       12     23   18      9  April

## Finding common rows with `dfply.intersect`

In [10]:
sales_may >> intersect(sales_apr)

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
0           0         Ann       22     18   15     12

## Finding rows unique to the left table.

Use `left_table >> dfply.set_diff(right_table)`

In [11]:
sales_may >> set_diff(sales_apr)

   Unnamed: 0 Salesperson  Compact  Sedan  SUV  Truck
1           1         Bob       20     14    6     24
2           2     Yolanda       19     10   28     17
3           3      Xerxes       11     27   17      9

## <font color="red"> Exercise 1 </font>

In the data folder, you will find 6 files that contain a sample 100,000 rows from the uber data for the month apr14-sep14.  Perform the following tasks:

1. Use `glob` to get all 6 file paths.
2. Use a regular expression to create a `lambda` function that pulls the month from the files.
3. Read the 6 data frames into a `dict` with keys equal to the month name and values containing the corresponding data frame.
4. Write a helper function that adds a month column each dictionary.  Use a dictionary comprehension to apply this helper to each `df`.
5. Use the accumulator pattern and `dfply.union` to combine these 6 data frames into one combined `df`
6. Inspect the head and shape of the resulting `df`

In [16]:
pd.set_option('display.max_columns', None)

In [20]:
import glob
paths = glob.glob("./data/uber/uber-trip-data/uber-raw-data-???14.csv")
paths

['./data/uber/uber-trip-data/uber-raw-data-apr14.csv',
 './data/uber/uber-trip-data/uber-raw-data-aug14.csv',
 './data/uber/uber-trip-data/uber-raw-data-jul14.csv',
 './data/uber/uber-trip-data/uber-raw-data-jun14.csv',
 './data/uber/uber-trip-data/uber-raw-data-may14.csv',
 './data/uber/uber-trip-data/uber-raw-data-sep14.csv']

In [12]:
import re
month_extractor = re.compile("([a-z]{3})14")
extract_month = lambda s: month_extractor.search(s).group(1)

In [13]:
extract_month("uber-raw-data-jul14.csv")

'jul'

In [14]:
data_dict = {extract_month(filepath) : pd.read_csv(filepath) for filepath in paths}

In [17]:
data_dict

{'apr':                  Date/Time      Lat      Lon    Base
 0         4/1/2014 0:11:00  40.7690 -73.9549  B02512
 1         4/1/2014 0:17:00  40.7267 -74.0345  B02512
 2         4/1/2014 0:21:00  40.7316 -73.9873  B02512
 3         4/1/2014 0:28:00  40.7588 -73.9776  B02512
 4         4/1/2014 0:33:00  40.7594 -73.9722  B02512
 ...                    ...      ...      ...     ...
 564511  4/30/2014 23:22:00  40.7640 -73.9744  B02764
 564512  4/30/2014 23:26:00  40.7629 -73.9672  B02764
 564513  4/30/2014 23:31:00  40.7443 -73.9889  B02764
 564514  4/30/2014 23:32:00  40.6756 -73.9405  B02764
 564515  4/30/2014 23:48:00  40.6880 -73.9608  B02764

 [564516 rows x 4 columns],
 'aug':                  Date/Time      Lat      Lon    Base
 0         8/1/2014 0:03:00  40.7366 -73.9906  B02512
 1         8/1/2014 0:09:00  40.7260 -73.9918  B02512
 2         8/1/2014 0:12:00  40.7209 -74.0507  B02512
 3         8/1/2014 0:12:00  40.7387 -73.9856  B02512
 4         8/1/2014 0:12:00  40.7323 -74.0077  B02512
 ...                    ...      ...      ...     ...
 829270  8/31/2014 23:55:00  40.7552 -73.9753  B02764
 829271  8/31/2014 23:55:00  40.7552 -73.9753  B02764
 829272  8/31/2014 23:55:00  40.7617 -73.9788  B02764
 829273  8/31/2014 23:59:00  40.7395 -73.9889  B02764
 829274  8/31/2014 23:59:00  40.7270 -73.9802  B02764

 [829275 rows x 4 columns],
 'jul':                  Date/Time      Lat      Lon    Base
 0         7/1/2014 0:03:00  40.7586 -73.9706  B02512
 1         7/1/2014 0:05:00  40.7605 -73.9994  B02512
 2         7/1/2014 0:06:00  40.7320 -73.9999  B02512
 3         7/1/2014 0:09:00  40.7635 -73.9793  B02512
 4         7/1/2014 0:20:00  40.7204 -74.0047  B02512
 ...                    ...      ...      ...     ...
 796116  7/31/2014 23:22:00  40.7285 -73.9846  B02764
 796117  7/31/2014 23:23:00  40.7615 -73.9868  B02764
 796118  7/31/2014 23:29:00  40.6770 -73.9515  B02764
 796119  7/31/2014 23:30:00  40.7225 -74.0038  B02764
 796120  7/31/2014 23:58:00  40.7199 -73.9884  B02764

 [796121 rows x 4 columns],
 'jun':                  Date/Time      Lat      Lon    Base
 0         6/1/2014 0:00:00  40.7293 -73.9920  B02512
 1         6/1/2014 0:01:00  40.7131 -74.0097  B02512
 2         6/1/2014 0:04:00  40.3461 -74.6610  B02512
 3         6/1/2014 0:04:00  40.7555 -73.9833  B02512
 4         6/1/2014 0:07:00  40.6880 -74.1831  B02512
 ...                    ...      ...      ...     ...
 663839  6/30/2014 22:40:00  40.7332 -73.9872  B02764
 663840  6/30/2014 23:12:00  40.7905 -73.9796  B02764
 663841  6/30/2014 23:13:00  40.7640 -73.9887  B02764
 663842  6/30/2014 23:15:00  40.7262 -73.9944  B02764
 663843  6/30/2014 23:35:00  40.7404 -73.9848  B02764

 [663844 rows x 4 columns],
 'may':                  Date/Time      Lat      Lon    Base
 0         5/1/2014 0:02:00  40.7521 -73.9914  B02512
 1         5/1/2014 0:06:00  40.6965 -73.9715  B02512
 2         5/1/2014 0:15:00  40.7464 -73.9838  B02512
 3         5/1/2014 0:17:00  40.7463 -74.0011  B02512
 4         5/1/2014 0:17:00  40.7594 -73.9734  B02512
 ...                    ...      ...      ...     ...
 652430  5/31/2014 23:45:00  40.7309 -74.0014  B02764
 652431  5/31/2014 23:52:00  40.7528 -73.9798  B02764
 652432  5/31/2014 23:55:00  40.7158 -73.9519  B02764
 652433  5/31/2014 23:56:00  40.6961 -73.8997  B02764
 652434  5/31/2014 23:59:00  40.7393 -73.9919  B02764

 [652435 rows x 4 columns],
 'sep':                   Date/Time      Lat      Lon    Base
 0          9/1/2014 0:01:00  40.2201 -74.0021  B02512
 1          9/1/2014 0:01:00  40.7500 -74.0027  B02512
 2          9/1/2014 0:03:00  40.7559 -73.9864  B02512
 3          9/1/2014 0:06:00  40.7450 -73.9889  B02512
 4          9/1/2014 0:11:00  40.8145 -73.9444  B02512
 ...                     ...      ...      ...     ...
 1028131  9/30/2014 22:57:00  40.7668 -73.9845  B02764
 1028132  9/30/2014 22:57:00  40.6911 -74.1773  B02764
 1028133  9/30/2014 22:58:00  40.8519 -73.9319  B02764
 1028134  9/30/2014 22:58:00  40.7081 -74.0066  B02764
 1028135  9/30/2014 22:58:00  40.7140 -73.9496  B02764

 [1028136 rows x 4 columns]}